// JavaScript Document
data = new Array();
data[   0] = "周末快乐，愉快心情";
data[ 901] = "今天是开学日，祝在校学子学业有成！";
data[ 907] = "今天是传统节气：白露 ";
data[ 910] = "今天是教师节，让我们感谢老师们的辛勤劳动 ";
data[ 925] = "今天是中秋节，家人团聚的日子，早点回家吧？";
data[ 923] = "今天是传统节气：秋分";
data[ 920] = "全国爱牙日，牙好，胃口就好，哈哈";
data[ 921] = "国际和平日，和平才和谐";
data[1001] = "今天是国庆节，欢度国庆！！";
data[1008] = "今天是传统节气：寒露";
data[1019] = "重阳节，登高望远，游子归乡！";
data[1023] = "今天是传统节气：霜降";
data[1031] = "万圣节，让我们去狂欢。";
data[1207] = "今天是传统节气：大雪";
data[1222] = "今天是传统节气：冬至";
data[1224] = "今天是平安夜，祝你平安！";
data[1225] = "圣诞快乐。";
data[ 101] = "新的一年、新的日子，日日顺心、事事如意,元旦快乐";
data[ 103] = "中国传统节日：腊八节";
data[ 105] = "中国传统节日：小寒";
data[ 1011] = "中国传统节日：尾牙";
data[ 1018] = "中国传统节日：小年";
data[ 1018] = "中国传统节日：大寒";
data[ 125] = "今天是除夕之夜，大家开开心心，辞旧迎新";
data[ 126] = "今天是春节，春节到，家家户户开开心心过大年咯！！";
data[ 130] = "今天是传统节气：破五 ";
data[ 201] = "今天是传统节气：天公生日 ";
data[ 202] = "世界湿地日，我们要保护地球村 ";
data[ 203] = "今天是传统节气：立春，感受春天的到来吧 ";
data[ 209] = "今天是中国传统节日：元宵节，记得吃汤圆啊！";
data[ 214] = "今天是情人节，想想你的另一半吧！";
data[ 218] = "今天是中国的传统节日：雨水";
data[ 226] = "今天是中国的传统节日：龙抬头";
data[ 301] = "国际海报日，我们要爱护动物哦";
data[ 303] = "国际爱耳日，保护听力，享受健康";
data[ 308] = "今天是妇女节！祝女同胞节日快乐。";
data[ 312] = "今天是植树节，让我们一起去绿化。";
data[ 315] = "今天是消费者权益日，让我们倡导透明消费。";
data[ 320] = "今天是传统节气：春分";
data[ 321] = "世界森林日 消除种族歧视国际日 世界诗歌日";
data[ 322] = "世界水日，节约用水，从我做起";
data[ 323] = "世界气象日，保护环境人人有责";
data[ 324] = "世界防结核病日，拥有健康，享受生命";
data[ 401] = "今天是愚人节，当心上当哦。";
data[ 404] = "今天是清明节，追思故人珍惜现在。";
data[ 407] = "世界卫生日，讲究卫生，拥有健康";
data[ 420] = "今天是传统节气：谷雨";
data[ 430] = "全国交通安全反思日，注意安全！";
data[ 501] = "劳动节快乐，劳动固然光荣，休息也很重要。";
data[ 504] = "青年节，美好的青年时光总值得回味";
data[ 508] = "世界红十字日，世界微笑日，和平";
data[ 510] = "今天是母亲节，别忘记向妈妈问候一声。";
data[ 521] = "今天是传统节气：小满";
data[ 528] = "今天是端午节，别忘记吃粽子。";
data[ 531] = "世界无烟日，爱护我们的环境";
data[ 601] = "今天是儿童节，让我们爱孩子，关注孩子！";
data[ 605] = "世界环境日，爱护地球，善待生命";
data[ 606] = "眼睛是心灵的窗口，好好保护";
data[ 607] = "祝全国考生考试顺利、鹏程万里。";
data[ 621] = "今天是父亲节，别忘记向父亲问好。";
data[ 701] = "中国共产党建党日";
data[ 707] = "勿忘国耻！7.7事变";
data[ 723] = "今天是传统节气：大暑";
data[ 808] = "中国男子节，呵呵，爸爸节";
data[ 808] = "国际左撇子日，你是右撇子吗？";
data[ 801] = "建军节，向所有的军人朋友问候一声。";
data[ 823] = "今天是传统节气：处暑";
data[ 826] = "今天是传统节气：七夕";

var da,ny,nm,nd;
document.getElementById("welcome").innerHTML="欢迎您来到150jjw用户管理中心";
da = new Date();
ny = da.getYear();
nm = da.getMonth() + 1;
nd = da.getDate();
if(nd < 10){
	nd = "0" + nd;	
}
nx = da.getDay();
str = "a" + nm + nd;
str1 = str.substring(1,10);
if(nx == 0 || nx == 6)
{
	document.getElementById("welcome").innerHTML = data[0];
}
if(data[str1] != undefined){
	document.getElementById("welcome").innerHTML = data[str1];
}
